[
  {
    "id": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Snake Plant is a hardy and striking houseplant known for its upright sword-like leaves with vibrant green and yellow patterns. It is one of the best air-purifying plants, removing toxins and improving indoor air quality. Thriving in low light and requiring minimal water, it’s ideal for beginners and busy households.",
    "image": "https://i.ibb.co/DH9z473Y/sarah-bronske-r-Gp-Z6-RKef-XU-unsplash.jpg",
    "providerName": "UrbanGreen Studio",
    "watering": "Water lightly every 2–3 weeks; allow soil to dry out completely between waterings.",
    "sunlight": "Low to bright indirect light; tolerates low light conditions.",
    "fertilizing": "Feed with a balanced liquid fertilizer once every 2–3 months during growing season."
  },
  {
    "id": 2,
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 15,
    "rating": 4.7,
    "availableStock": 8,
    "careLevel": "Easy",
    "description": "The Spider Plant is an adaptable, fast-growing indoor plant admired for its arching green-and-white striped leaves. It effectively cleans indoor air by absorbing harmful pollutants, making it perfect for homes and offices. This low-maintenance beauty grows baby offshoots, is non-toxic to pets, and thrives in indirect light with moderate watering.",
    "image": "https://i.ibb.co/0jhybcMh/feey-Rt-H6r-Y9k738-unsplash.jpg",
    "providerName": "GreenThumb Nursery",
    "watering": "Keep soil slightly moist; water every 7–10 days.",
    "sunlight": "Bright, indirect sunlight; avoid direct afternoon sun.",
    "fertilizing": "Feed every 2 weeks with diluted houseplant fertilizer during spring and summer."
  },
  {
    "id": 3,
    "plantName": "Peace Lily",
    "category": "Air Purifier",
    "price": 20,
    "rating": 4.9,
    "availableStock": 12,
    "careLevel": "Moderate",
    "description": "The Peace Lily features graceful white blooms that contrast beautifully against its deep green leaves. Renowned for purifying indoor air, it filters out toxins and improves humidity. Peace Lilies thrive in shaded spaces and need regular watering to maintain their lush appearance, offering both elegance and natural freshness indoors.",
    "image": "https://i.ibb.co/rfMT3fZ2/feey-lmcz-Pem-Wj-QQ-unsplash.jpg",
    "providerName": "Bloom & Grow",
    "watering": "Water weekly, keeping soil consistently moist but not soggy.",
    "sunlight": "Low to medium indirect light.",
    "fertilizing": "Use a balanced houseplant fertilizer every 6 weeks in growing season."
  },
  {
    "id": 4,
    "plantName": "Aloe Vera",
    "category": "Medicinal",
    "price": 12,
    "rating": 4.6,
    "availableStock": 15,
    "careLevel": "Easy",
    "description": "Aloe Vera is a popular succulent prized for its soothing gel used in skincare and healing minor burns. Its plump, fleshy leaves store water, making it highly drought-resistant and easy to care for. Preferring bright light and minimal watering, Aloe Vera doubles as a decorative and medicinal household essential.",
    "image": "https://i.ibb.co/q3nXxWdY/stephanie-harvey-T0inbt7n-RME-unsplash.jpg",
    "providerName": "Herb Haven",
    "watering": "Water deeply every 3 weeks or when soil is completely dry.",
    "sunlight": "Bright, indirect sunlight; can tolerate direct sun for a few hours.",
    "fertilizing": "Feed once every 2 months with succulent-specific fertilizer."
  },
  {
    "id": 5,
    "plantName": "English Ivy",
    "category": "Air Purifier",
    "price": 10,
    "rating": 4.5,
    "availableStock": 20,
    "careLevel": "Moderate",
    "description": "English Ivy is a classic climbing vine celebrated for its lush green leaves and ability to filter airborne toxins. Perfect for hanging baskets or decorative trellises, it brings timeless charm to any space. It thrives in bright, indirect light and cool environments, adding elegance while improving indoor air quality.",
    "image": "https://i.ibb.co/8DZHBD6p/jerry-wang-8-Da7-Sg-PKGC8-unsplash.jpg",
    "providerName": "Vine & Leaf",
    "watering": "Keep soil evenly moist; water when top inch feels dry.",
    "sunlight": "Bright, indirect light; prefers cooler indoor temperatures.",
    "fertilizing": "Feed monthly with balanced liquid fertilizer during growth periods."
  },
  {
    "id": 6,
    "plantName": "ZZ Plant",
    "category": "Low Light",
    "price": 25,
    "rating": 4.8,
    "availableStock": 5,
    "careLevel": "Easy",
    "description": "The ZZ Plant is a tough, resilient favorite for low-light spaces. Its glossy, dark green leaves store water in their rhizomes, allowing it to survive long periods without attention. Known for its sleek, modern look, the ZZ Plant thrives on neglect, purifying air and adding a stylish touch anywhere.",
    "image": "https://i.ibb.co/DHf7FQsx/feey-1gwj-E0c3-PSQ-unsplash.jpg",
    "providerName": "Shade & Shine",
    "watering": "Water once every 3–4 weeks; let soil dry between waterings.",
    "sunlight": "Low to moderate indirect light; avoid direct sunlight.",
    "fertilizing": "Feed lightly every 2–3 months with diluted fertilizer."
  },
  {
    "id": 7,
    "plantName": "Pothos",
    "category": "Low Light",
    "price": 18,
    "rating": 4.7,
    "availableStock": 18,
    "careLevel": "Easy",
    "description": "Pothos, often called Devil’s Ivy, is a popular trailing vine with heart-shaped green or variegated leaves. It thrives in low light and requires minimal care, making it ideal for beginners. Known for its air-purifying qualities, Pothos grows quickly, adapting to both soil and water, and brings natural beauty to interiors.",
    "image": "https://i.ibb.co/2BMzSb7/zinah-insignia-Lv6x-TKbzh-M4-unsplash.jpg",
    "providerName": "Leafy Greens",
    "watering": "Water every 1–2 weeks; allow topsoil to dry between watering.",
    "sunlight": "Low to bright, indirect light.",
    "fertilizing": "Fertilize once a month during growing season with balanced liquid feed."
  },
  {
    "id": 8,
    "plantName": "Philodendron",
    "category": "Low Light",
    "price": 22,
    "rating": 4.6,
    "availableStock": 10,
    "careLevel": "Moderate",
    "description": "Philodendrons are tropical houseplants for their large, glossy, heart-shaped leaves that add lush greenery indoors. They adapt well to low light and moderate watering schedules. Their graceful vines can trail or climb, making them perfect for shelves or hanging planters. They bring warmth, freshness, and tropical charm to interiors.",
    "image": "https://i.ibb.co/jZPqMQ7H/feey-ajg-VAG2-Ky-QQ-unsplash.jpg",
    "providerName": "Tropical Treasures",
    "watering": "Water once the top inch of soil feels dry; avoid waterlogging.",
    "sunlight": "Medium to bright, indirect light.",
    "fertilizing": "Feed every 4–6 weeks during spring and summer."
  },
  {
    "id": 9,
    "plantName": "Fiddle Leaf Fig",
    "category": "Statement",
    "price": 35,
    "rating": 4.4,
    "availableStock": 6,
    "careLevel": "Moderate",
    "description": "The Fiddle Leaf Fig is a bold indoor statement plant with broad, violin-shaped leaves that instantly elevate any room’s decor. It thrives in bright, indirect light and needs consistent watering. With its modern, architectural form, this plant brings sophistication and a fresh, tropical atmosphere to homes and offices alike.",
    "image": "https://i.ibb.co/jv7RSDNd/kara-eads-Eb-LX7o-Ro4v-I-unsplash.jpg",
    "providerName": "Designer's Choice",
    "watering": "Water once a week; keep soil consistently moist but not soggy.",
    "sunlight": "Bright, filtered light; avoid cold drafts and direct sun.",
    "fertilizing": "Feed every month during growing season with nitrogen-rich fertilizer."
  },
  {
    "id": 10,
    "plantName": "Monstera Deliciosa",
    "category": "Statement",
    "price": 30,
    "rating": 4.8,
    "availableStock": 8,
    "careLevel": "Moderate",
    "description": "Monstera Deliciosa, also known as the Swiss Cheese Plant, is famous for its iconic split leaves and tropical appeal. It thrives in bright, indirect light and benefits from occasional misting. This plant grows vigorously, making it a striking centerpiece that brings jungle vibes and lush energy into any living space.",
    "image": "https://i.ibb.co/NgxDnWbT/feey-bws-TJMnhcw-E-unsplash-1.jpg",
    "providerName": "Jungle Vibes",
    "watering": "Water once a week or when top inch of soil is dry; mist leaves regularly.",
    "sunlight": "Bright, indirect light; avoid harsh direct sunlight.",
    "fertilizing": "Fertilize every 4–6 weeks during spring and summer with houseplant fertilizer."
  },
  {
    "id": 11,
    "plantName": "Rubber Plant",
    "category": "Statement",
    "price": 28,
    "rating": 4.5,
    "availableStock": 7,
    "careLevel": "Moderate",
    "description": "The Rubber Plant is known for its shiny, deep green leaves that create a sophisticated, contemporary aesthetic. It purifies air effectively and thrives in bright, filtered light. With minimal watering and proper drainage, it grows tall and sturdy, adding bold structure and timeless beauty to modern homes or workspaces.",
    "image": "https://i.ibb.co/7xzGhTS4/denley-photography-GNd-Lc38z-Nj-U-unsplash.jpg",
    "providerName": "Urban Oasis",
    "watering": "Water every 1–2 weeks; let the soil dry between waterings.",
    "sunlight": "Bright, indirect light; can tolerate some morning sun.",
    "fertilizing": "Feed once a month with balanced fertilizer during active growth."
  },
  {
    "id": 12,
    "plantName": "Dracaena",
    "category": "Low Light",
    "price": 20,
    "rating": 4.6,
    "availableStock": 10,
    "careLevel": "Moderate",
    "description": "Dracaena plants feature long, narrow leaves that give a graceful, tropical appearance to any indoor setting. They are tolerant of low light and irregular watering, making them a resilient choice for homes and offices. Dracaenas purify indoor air while adding height, color, and sophistication to both modern and classic interiors.",
    "image": "https://i.ibb.co/rfMT3fZ2/feey-lmcz-Pem-Wj-QQ-unsplash.jpg",
    "providerName": "Leaf & Root",
    "watering": "Water every 10–14 days; allow top soil to dry before watering again.",
    "sunlight": "Low to medium indirect light.",
    "fertilizing": "Feed every 2 months with a balanced houseplant fertilizer."
  }
]
